xdu-aero-association/FM33LC0XX_Example_0.04/AES CTR模式/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_u7816.h
/**
  * @brief    
  * @rmtoll   ISR    RPARERR    LL_U7816_IsActiveFlag_RxParityError
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_RxParityError(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_RPARERR_Msk) == (U7816_ISR_RPARERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RPARERR    LL_U7816_ClearFlag_RxParityError
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void LL_U7816_ClearFlag_RxParityError(U7816_Type* U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_RPARERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    FRERR    LL_U7816_IsActiveFlag_RxFreamError
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_RxFreamError(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_FRERR_Msk) == (U7816_ISR_FRERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    FRERR    LL_U7816_ClearFlag_RxFreamError
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void LL_U7816_ClearFlag_RxFreamError(U7816_Type* U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_FRERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    OVERR    LL_U7816_IsActiveFlag_RxOverFlow
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_RxOverFlow(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_OVERR_Msk) == (U7816_ISR_OVERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    OVERR    LL_U7816_ClearFlag_RxOverFlow
  * @param    U7816x U7816 instance
  * @retval   None
  */
__STATIC_INLINE void LL_U7816_ClearFlag_RxOverFlow(U7816_Type* U7816x)
{
    WRITE_REG(U7816x->ISR, U7816_ISR_OVERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    OVERR    LL_U7816_IsActiveFlag_Rx
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_Rx(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_OVERR_Msk) == (U7816_ISR_OVERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    RXIF    LL_U7816_IsActiveFlag_RxComplete
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_RxComplete(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_RXIF_Msk) == (U7816_ISR_RXIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    TXIF    LL_U7816_IsActiveFlag_TxBuffEmpty
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_TxBuffEmpty(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_TXIF_Msk) == (U7816_ISR_TXIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    ERRIF    LL_U7816_IsActiveFlag_Error
  * @param    U7816x U7816 instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_U7816_IsActiveFlag_Error(U7816_Type* U7816x)
{
    return (uint32_t)(READ_BIT(U7816x->ISR, U7816_ISR_ERRIF_Msk) == (U7816_ISR_ERRIF_Msk));
}

/**
  * @}
  */

/** @defgroup U7816_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_U7816_DeInit(U7816_Type *U7816x);
ErrorStatus LL_U7816_Init(U7816_Type *U7816x,LL_U7816_InitTypeDef *U7816_InitStruct);
void LL_U7816_StructInit(LL_U7816_InitTypeDef *U7816_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_U7816_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-10-17**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
